In this notebook I will clean my powerseats.csv and clean it before making a svg

In [11]:
import requests

In [12]:
import pandas as pd

In [13]:
pp_df = pd.read_csv("powerseats.csv")
pp_df.dtypes
pp_df.head()

  Hallitukset ja tj:t vallan verkostoon 23.4.2024           Unnamed: 1
0                                             NaN                  NaN
1                                      Row Labels  Count of personName
2                                     Risto Murto                    2
3                                      Arja Talma                    4
4                               Frank Vang-Jensen                    1

In [15]:
pp_df.rename(columns={'Hallitukset ja tj:t vallan verkostoon 23.4.2024': 'Names'}, inplace=True)
pp_df.head()

               Names           Unnamed: 1
0                NaN                  NaN
1         Row Labels  Count of personName
2        Risto Murto                    2
3         Arja Talma                    4
4  Frank Vang-Jensen                    1

In [20]:
pp_df.rename(columns={'Unnamed: 1': 'Boardseats'}, inplace=True)
pp_df.head()

               Names           Boardseats
0                NaN                  NaN
1         Row Labels  Count of personName
2        Risto Murto                    2
3         Arja Talma                    4
4  Frank Vang-Jensen                    1

In [21]:
pp_df = pp_df.drop([0, 1])
pp_df.reset_index(drop=True, inplace=True)
pp_df.head()

                   Names Boardseats
0            Risto Murto          2
1             Arja Talma          4
2      Frank Vang-Jensen          1
3         Gerhard Olsson          1
4  Hans Christian  Riise          1

In [22]:
pp_df['Boardseats'] = pp_df['Boardseats'].astype(int)
pp_df.dtypes

Names         object
Boardseats     int64
dtype: object

In [23]:
pp_df.groupby('Boardseats').Boardseats.value_counts().sort_values(ascending=False)

Boardseats
1    985
2    125
3     28
4      3
5      3
Name: count, dtype: int64

In [26]:
pp_df = pp_df.sort_values(by='Boardseats', ascending=False)


#pp_df.reset_index(drop=True, inplace=True)

# Display the DataFrame to verify the change
pp_df.head()

              Names  Boardseats
196   Anne Koutonen           5
385  Anni Ronkainen           5
363  Leena Niemistö           5
230    Mammu Kaario           4
189   Robert Ingman           4

In [27]:
bs_average= pp_df['Boardseats'].mean()
bs_average

1.1765734265734267

In [31]:
bs_average_round = round(bs_average, 2)

bs_average_round

1.18

In [30]:
totalcount = pp_df['Boardseats'].count()

# Number of rows where 'Boardseats' is greater than 1
morethanone = pp_df[pp_df['Boardseats'] > 1].shape[0]

# Calculate the percentage
percentage_morethanone = (morethanone / totalcount) * 100

# Display the result
percentage_morethanone

13.898601398601398